danil0m/contiki/platform/stm32nucleo-spirit1/spirit1.c
  PRINTF("READY OUT\r\n");
}
/*---------------------------------------------------------------------------*/
static int
spirit_radio_init(void)
{

  PRINTF("RADIO INIT IN\r\n");

  st_lib_spirit_spi_init();

  /* Configure radio shut-down (SDN) pin and activate radio */
  st_lib_radio_gpio_init(RADIO_GPIO_SDN, RADIO_MODE_GPIO_OUT);

  /* Configures the SPIRIT1 library */
  st_lib_spirit_radio_set_xtal_frequency(XTAL_FREQUENCY);
  st_lib_spirit_management_set_frequency_base(XTAL_FREQUENCY);

  /* wake up to READY state */
  /* weirdly enough, this *should* actually *set* the pin, not clear it! The pins is declared as GPIO_pin13 == 0x2000 */
  RADIO_GPIO_SDN_PORT->BSRR = RADIO_GPIO_SDN_PIN;
  st_lib_hal_gpio_write_pin(RADIO_GPIO_SDN_PORT, RADIO_GPIO_SDN_PIN, GPIO_PIN_RESET);

  /* wait minimum 1.5 ms to allow SPIRIT1 a proper boot-up sequence */
  BUSYWAIT_UNTIL(0, 3 * RTIMER_SECOND / 2000);

  /* Soft reset of core */
  spirit1_strobe(SPIRIT1_STROBE_SRES);

  /* Configures the SPIRIT1 radio part */
  st_lib_s_radio_init x_radio_init = {
    /* XTAL_FREQUENCY, */
    XTAL_OFFSET_PPM,
    BASE_FREQUENCY,
    CHANNEL_SPACE,
    CHANNEL_NUMBER,
    MODULATION_SELECT,
    DATARATE,
    FREQ_DEVIATION,
    BANDWIDTH
  };
  st_lib_spirit_radio_init(&x_radio_init);
  st_lib_spirit_radio_set_xtal_frequency(XTAL_FREQUENCY);
  st_lib_spirit_radio_set_pa_level_dbm(0, POWER_DBM);
  st_lib_spirit_radio_set_pa_level_max_index(0);

  /* Configures the SPIRIT1 packet handler part*/
  st_lib_pkt_basic_init x_basic_init = {
    PREAMBLE_LENGTH,
    SYNC_LENGTH,
    SYNC_WORD,
    LENGTH_TYPE,
    LENGTH_WIDTH,
    CRC_MODE,
    CONTROL_LENGTH,
    EN_ADDRESS,
    EN_FEC,
    EN_WHITENING
  };
  st_lib_spirit_pkt_basic_init(&x_basic_init);

  /* Enable the following interrupt sources, routed to GPIO */
  st_lib_spirit_irq_de_init(NULL);
  st_lib_spirit_irq_clear_status();
  st_lib_spirit_irq(TX_DATA_SENT, S_ENABLE);
  st_lib_spirit_irq(RX_DATA_READY, S_ENABLE);
  st_lib_spirit_irq(VALID_SYNC, S_ENABLE);
  st_lib_spirit_irq(RX_DATA_DISC, S_ENABLE);
  st_lib_spirit_irq(TX_FIFO_ERROR, S_ENABLE);
  st_lib_spirit_irq(RX_FIFO_ERROR, S_ENABLE);
  st_lib_spirit_irq(RSSI_ABOVE_TH, S_ENABLE);
  /* Configure Spirit1 */
  st_lib_spirit_radio_persisten_rx(S_ENABLE);
  st_lib_spirit_qi_set_sqi_threshold(SQI_TH_0);
  st_lib_spirit_qi_sqi_check(S_ENABLE);
  st_lib_spirit_qi_set_rssi_threshold_dbm(CCA_THRESHOLD);
  st_lib_spirit_timer_set_rx_timeout_stop_condition(SQI_ABOVE_THRESHOLD);
  SET_INFINITE_RX_TIMEOUT();
  st_lib_spirit_radio_afc_freeze_on_sync(S_ENABLE);
  /* Puts the SPIRIT1 in STANDBY mode (125us -> rx/tx) */
  spirit1_strobe(SPIRIT1_STROBE_STANDBY);
  spirit_on = OFF;
  CLEAR_RXBUF();
  CLEAR_TXBUF();

  /* Initializes the mcu pin as input, used for IRQ */
  st_lib_radio_gpio_init(RADIO_GPIO_IRQ, RADIO_MODE_EXTI_IN);

  /* Configure the radio to route the IRQ signal to its GPIO 3 */
  st_lib_spirit_gpio_init(&(st_lib_s_gpio_init){SPIRIT_GPIO_IRQ, SPIRIT_GPIO_MODE_DIGITAL_OUTPUT_LP, SPIRIT_GPIO_DIG_OUT_IRQ });

  process_start(&spirit_radio_process, NULL);

#if DEBUG
  process_start(&rssi_above_in_process, NULL);
  process_start(&rssi_above_out_process, NULL);
#endif
  PRINTF("Spirit1 init done\r\n");
  return 0;
}
/*---------------------------------------------------------------------------*/
static int
spirit_radio_prepare(const void *payload, unsigned short payload_len)
{
  PRINTF("Spirit1: prep %u\r\n", payload_len);
  packet_is_prepared = 0;

  /* Checks if the payload length is supported */
  if(payload_len > MAX_PACKET_LEN) {
    return RADIO_TX_ERR;
  }

  /* Should we delay for an ack? */
#if NULLRDC_CONF_802154_AUTOACK
  frame802154_t info154;
  wants_an_ack = 0;
  if(payload_len > ACK_LEN
     && frame802154_parse((char *)payload, payload_len, &info154) != 0) {
    if(info154.fcf.frame_type == FRAME802154_DATAFRAME
       && info154.fcf.ack_required != 0) {
      wants_an_ack = 1;
    }
  }
#endif /* NULLRDC_CONF_802154_AUTOACK */

  /* Sets the length of the packet to send */
  IRQ_DISABLE();
  spirit1_strobe(SPIRIT1_STROBE_FTX);
  st_lib_spirit_pkt_basic_set_payload_length(payload_len);
  st_lib_spirit_spi_write_linear_fifo(payload_len, (uint8_t *)payload);
  IRQ_ENABLE();

  PRINTF("PREPARE OUT\r\n");

  packet_is_prepared = 1;
  return RADIO_TX_OK;
}
/*---------------------------------------------------------------------------*/
static int
spirit_radio_transmit(unsigned short payload_len)
{
  /* This function blocks until the packet has been transmitted */
  rtimer_clock_t rtimer_txdone, rtimer_rxack;

  PRINTF("TRANSMIT IN\r\n");
  if(!packet_is_prepared) {
	  PRINTF("Spirit1: Error transmit\r\n");
	  return RADIO_TX_ERR;
  }

  /* Stores the length of the packet to send */
  /* Others spirit_radio_prepare will be in hold */
  spirit_txbuf[0] = payload_len;
  PRINTF("Spirit1: SPIRIT STATUS %x\r\n",SPIRIT1_STATUS()>>1);
#ifdef CSMA_SW
  int rand_numb;
  rand_numb=random_rand()%10;
  BUSYWAIT_UNTIL(SpiritQiGetCs(),2*RTIMER_SECOND / 1000);
  if(SpiritQiGetCs()){
		 PRINTF("Spirit1: detected collision\r\n");
		    	  return RADIO_TX_COLLISION;
	}
  /*rssi_above=0;
  BUSYWAIT_UNTIL(rssi_above, (32+rand_numb)* RTIMER_SECOND / 1000);
     if(rssi_above){
      	  PRINTF("Spirit1: detected collision\r\n");
      	  return RADIO_TX_NOACK;
        }*/
#endif
  /* Puts the SPIRIT1 in TX state */
  receiving_packet = 0;
  spirit_set_ready_state();
  PRINTF("Spirit1: SPIRIT STATUS %x\r\n",SPIRIT1_STATUS()>>1);
#ifdef CSMA_HW
  SpiritCsma(S_ENABLE);
#endif
  spirit1_strobe(SPIRIT1_STROBE_TX);
  just_got_an_ack = 0;
  BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_TX, 1 * RTIMER_SECOND / 1000);
  /* BUSYWAIT_UNTIL(SPIRIT1_STATUS() != SPIRIT1_STATE_TX, 4 * RTIMER_SECOND/1000); //For GFSK with high data rate */
  BUSYWAIT_UNTIL(SPIRIT1_STATUS() != SPIRIT1_STATE_TX, 50 * RTIMER_SECOND / 1000); /* For FSK with low data rate */

  PRINTF("Spirit1: SPIRIT STATUS %x\r\n",SPIRIT1_STATUS()>>1);
  /* Reset radio - needed for immediate RX of ack */
  CLEAR_TXBUF();
  //CLEAR_RXBUF();
  IRQ_DISABLE();
  st_lib_spirit_irq_clear_status();
  spirit1_strobe(SPIRIT1_STROBE_SABORT);
  BUSYWAIT_UNTIL(0, RTIMER_SECOND / 2500);
  spirit1_strobe(SPIRIT1_STROBE_READY);
  BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_READY, 1 * RTIMER_SECOND / 1000);
#ifdef CSMA_HW
  SpiritCsma(S_DISABLE);
#endif
  spirit1_strobe(SPIRIT1_STROBE_RX);
  BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_RX, 1 * RTIMER_SECOND / 1000);
  IRQ_ENABLE();

