danil0m/contiki/platform/stm32nucleo-spirit1/spirit1.c
      if(SPIRIT1_STATUS() == SPIRIT1_STATE_READY) {
        spirit1_strobe(SPIRIT1_STROBE_RX);
        BUSYWAIT_UNTIL(SPIRIT1_STATUS() == SPIRIT1_STATE_RX, 1 * RTIMER_SECOND / 1000);
      }
    }
  }

  PROCESS_END();
}
PROCESS_THREAD(rssi_above_in_process, ev, data){
	PROCESS_BEGIN();
	while(1){
		PROCESS_YIELD();
		if(ev==PROCESS_EVENT_POLL){

			PRINTF("RSSI above IN\r\n");
			}
		}

	PROCESS_END();
}

PROCESS_THREAD(rssi_above_out_process, ev, data){
	PROCESS_BEGIN();
	while(1){
	PROCESS_YIELD();
	if(ev==PROCESS_EVENT_POLL){

		PRINTF("rx full\r\n");
		}
	}
	PROCESS_END();
}

/*---------------------------------------------------------------------------*/
void
spirit1_interrupt_callback(void)
{
#define INTPRINTF(...) /* PRINTF */
  st_lib_spirit_irqs x_irq_status;
  if(spirit_spi_busy() || interrupt_callback_in_progress) {
    process_poll(&spirit_radio_process);
    interrupt_callback_wants_poll = 1;
    return;
  }

  interrupt_callback_wants_poll = 0;
  interrupt_callback_in_progress = 1;

  /* get interrupt source from radio */
  st_lib_spirit_irq_get_status(&x_irq_status);
  st_lib_spirit_irq_clear_status();

  if(x_irq_status.IRQ_RX_FIFO_ERROR) {
    receiving_packet = 0;
    interrupt_callback_in_progress = 0;
    spirit1_strobe(SPIRIT1_STROBE_FRX);
    return;
  }

  if(x_irq_status.IRQ_TX_FIFO_ERROR) {
    receiving_packet = 0;
    interrupt_callback_in_progress = 0;
    spirit1_strobe(SPIRIT1_STROBE_FTX);
    return;
  }

  /* The IRQ_VALID_SYNC is used to notify a new packet is coming */
  if(x_irq_status.IRQ_VALID_SYNC) {
    INTPRINTF("SYNC\r\n");
    receiving_packet = 1;
  }

  /* The IRQ_TX_DATA_SENT notifies the packet received. Puts the SPIRIT1 in RX */
  if(x_irq_status.IRQ_TX_DATA_SENT) {
    spirit1_strobe(SPIRIT1_STROBE_RX);
/*    SpiritCmdStrobeRx();*/
    INTPRINTF("SENT\r\n");
    CLEAR_TXBUF();
    interrupt_callback_in_progress = 0;
    return;
  }

  /* The IRQ_RX_DATA_READY notifies a new packet arrived */
  if(x_irq_status.IRQ_RX_DATA_READY) {
    if(IS_RXBUF_FULL()){
    	process_poll(&rssi_above_out_process);
    }
	  st_lib_spirit_spi_read_linear_fifo(st_lib_spirit_linear_fifo_read_num_elements_rx_fifo(),
                                       &spirit_rxbuf[1]);
    spirit_rxbuf[0] = st_lib_spirit_pkt_basic_get_received_pkt_length();
    spirit1_strobe(SPIRIT1_STROBE_FRX);

    INTPRINTF("RECEIVED\r\n");

    process_poll(&spirit_radio_process);

    last_rssi = (packetbuf_attr_t)st_lib_spirit_qi_get_rssi();  /* MGR */
    last_lqi = (packetbuf_attr_t)st_lib_spirit_qi_get_lqi();    /* MGR */

    receiving_packet = 0;

#if NULLRDC_CONF_802154_AUTOACK
    if(spirit_rxbuf[0] == ACK_LEN) {
      /* For debugging purposes we assume this is an ack for us */
      just_got_an_ack = 1;
    }
#endif /* NULLRDC_CONF_802154_AUTOACK */

    interrupt_callback_in_progress = 0;
    return;
  }

  if(x_irq_status.IRQ_RX_DATA_DISC) {
    /* RX command - to ensure the device will be ready for the next reception */
    if(x_irq_status.IRQ_RX_TIMEOUT) {
      st_lib_spirit_cmd_strobe_flush_rx_fifo();
      rx_timeout = SET;
    }
  }

  if(x_irq_status.IRQ_RSSI_ABOVE_TH){
	  rssi_above=1;
	  process_poll(&rssi_above_in_process);
  }


  interrupt_callback_in_progress = 0;
}
/*---------------------------------------------------------------------------*/
